1. Exercício: Carregar um arquivo e exibir as primeiras 5 linhas.

In [ ]:
import pandas as pd
import numpy as np

# Carregando o arquivo
df = pd.read_excel("dados_ausentes.xlsx")
print(df.head(5))

2. Exercício: Verificar se há valores NaN nas colunas do DataFrame.

In [ ]:
print(df.isnull())

3. Exercício: Substituir os valores NaN de uma coluna por 0.

In [ ]:
df['Salário'].fillna(0, inplace=True)
print(df)

4. Exercício: Substituir os valores NaN de uma coluna por um valor específico
(por exemplo, a média).

In [ ]:
df['Idade'].fillna(df['Idade'].mean(), inplace=True)
print(df)

5. Exercício: Remover todas as linhas que contêm valores NaN em qualquer
coluna

In [ ]:
df_sem_nulos = df.dropna()

print(df_sem_nulos)

6. Exercício: Remover todas as linhas que contêm valores NaN em uma
coluna específica.

In [ ]:
df_sem_nulos = df.dropna()

print(df_sem_nulos)

7. Exercício: Substituir valores NaN de uma coluna com a mediana dessa
coluna.

In [ ]:

df['Idade'].fillna(df['Idade'].median())

8. Exercício: Substituir valores NaN de uma coluna com o valor de uma outra
coluna.

In [ ]:
df['Idade'].fillna(df['Cidade'], inplace=True)

9. Exercício: Preencher valores NaN com o valor anterior (método de &quot;forward
fill&quot;).

In [ ]:
#pega o valor de cima
df['Idade'] = df['Idade'].ffill()

10. Exercício: Preencher valores NaN com o valor posterior (método de
&quot;backward fill&quot;).

In [ ]:
df['Idade'] = df['Idade'].bfill()

11. Exercício: Alterar todos os valores de uma coluna para maiúsculas.

In [20]:
df['Cidade'] = df['Cidade'].str.upper()
print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       SÃO PAULO   3500.0
1    Maria   27.0  RIO DE JANEIRO   4500.0
2     José   35.0    DESCONHECIDO      0.0
3      Ana   22.0        SALVADOR   5000.0
4    Pedro   27.0    PORTO ALEGRE   4800.0
5      Ana   22.0        SALVADOR   5000.0
6  Jessica   20.0      SÃO PAULO    3410.0
7   Carlos   35.0    PORTO ALEGRE   2500.0

12. Exercício: Alterar todos os valores de uma coluna para minúsculas.

In [ ]:
df['Cidade'] = df['Cidade'].str.lower()
print(df)

13. Exercício: Remover espaços em branco à esquerda e à direita em uma
coluna.

In [ ]:
df_sem_nulos = df.dropna()

print(df_sem_nulos)

14. Exercício: Substituir valores de uma coluna com base em um dicionário de
mapeamento (ex: &quot;São Paulo&quot; para &quot;SP&quot;).

In [ ]:
df['Cidade'] = df['Cidade'].str.lower().replace({'sao paulo': 'SP', 'rio de janeiro': 'rj', 'rj': 'RJ'})
print(df)

15 - Exercício: Identificar e remover valores duplicados de um DataFrame.

In [22]:
duplicadas = df.duplicated()

print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       SÃO PAULO   3500.0
1    Maria   27.0  RIO DE JANEIRO   4500.0
2     José   35.0    DESCONHECIDO      0.0
3      Ana   22.0        SALVADOR   5000.0
4    Pedro   27.0    PORTO ALEGRE   4800.0
5      Ana   22.0        SALVADOR   5000.0
6  Jessica   20.0      SÃO PAULO    3410.0
7   Carlos   35.0    PORTO ALEGRE   2500.0